<script setup lang="ts">
//👉 Imports
import Container from "~/components/shared/Container.vue";

//👉 Composables
const { t } = useI18n();

//👉 Meta
useHead({
  title: computed(() => `${t("Adak")} - ${t("Privacy Policy")}`),
});
</script>

<template>
  <Container>
    <div class="privacy-container flex flex-col lg:gap-8 sm:gap-6 gap-4 lg:my-20 sm:my-14 my-10">
      <!-- Header  -->
      <div class="privacy_header space-y-2">
        <h2 class="lg:text-3xl sm:text-2xl text-xl font-bold text-[#002122]">
          سياسة الخصوصية
        </h2>
        <p class="lg:text-base sm:text-sm text-xs">
          نحن في منصة ADAQ نلتزم بحماية خصوصية معلوماتك الشخصية وبياناتك.
        </p>
      </div>
      <!-- Content  -->
      <div class="privacy_content flex flex-col lg:gap-8 sm:gap-6 gap-4">
        <div class="space-y-2">
          <h2 class="lg:text-xl sm:text-lg text-base font-bold text-[#115E59]">
            1. جمع البيانات لتحسين الخدمة
          </h2>
          <p class="lg:text-sm text-xs">
            نقوم بجمع البيانات بهدف تحسين خدماتنا وتقديم تجربة توظيف أكثر دقة
            وفعالية. نستخدم البيانات لفهم سلوك المستخدمين، وتطوير خوارزميات
            الذكاء الاصطناعي، وتحسين دقة الترشيحات بين المرشحين والوظائف. تشمل
            هذه البيانات تفاعلاتك مع المنصة، تفضيلاتك، وسجل البحث والتقديم، مما
            يساعدنا على تقديم توصيات أكثر ملاءمة لك مع مرور الوقت. نلتزم بأن يتم
            استخدام هذه البيانات فقط في تحسين جودة الخدمة، وليس لأي أغراض تجارية
            خارج نطاق المنصة.
          </p>
        </div>
        <div class="space-y-2">
          <h2 class="lg:text-xl sm:text-lg text-base font-bold text-[#115E59]">
            2. حماية البيانات والتشفير
          </h2>
          <p class="lg:text-sm text-xs">
            نقوم بجمع البيانات بهدف تحسين خدماتنا وتقديم تجربة توظيف أكثر دقة
            وفعالية. نستخدم البيانات لفهم سلوك المستخدمين، وتطوير خوارزميات
            الذكاء الاصطناعي، وتحسين دقة الترشيحات بين المرشحين والوظائف. تشمل
            هذه البيانات تفاعلاتك مع المنصة، تفضيلاتك، وسجل البحث والتقديم، مما
            يساعدنا على تقديم توصيات أكثر ملاءمة لك مع مرور الوقت. نلتزم بأن يتم
            استخدام هذه البيانات فقط في تحسين جودة الخدمة، وليس لأي أغراض تجارية
            خارج نطاق المنصة.
          </p>
        </div>
        <div class="space-y-2">
          <h2 class="lg:text-xl sm:text-lg text-base font-bold text-[#115E59]">
            3. التحكم في البيانات
          </h2>
          <p class="lg:text-sm text-xs">
            نقوم بجمع البيانات بهدف تحسين خدماتنا وتقديم تجربة توظيف أكثر دقة
            وفعالية. نستخدم البيانات لفهم سلوك المستخدمين، وتطوير خوارزميات
            الذكاء الاصطناعي، وتحسين دقة الترشيحات بين المرشحين والوظائف. تشمل
            هذه البيانات تفاعلاتك مع المنصة، تفضيلاتك، وسجل البحث والتقديم، مما
            يساعدنا على تقديم توصيات أكثر ملاءمة لك مع مرور الوقت. نلتزم بأن يتم
            استخدام هذه البيانات فقط في تحسين جودة الخدمة، وليس لأي أغراض تجارية
            خارج نطاق المنصة.
          </p>
        </div>
        <div class="space-y-2">
          <h2 class="lg:text-xl sm:text-lg text-base font-bold text-[#115E59]">
            4. عدم بيع البيانات
          </h2>
          <p class="lg:text-sm text-xs">
            نقوم بجمع البيانات بهدف تحسين خدماتنا وتقديم تجربة توظيف أكثر دقة
            وفعالية. نستخدم البيانات لفهم سلوك المستخدمين، وتطوير خوارزميات
            الذكاء الاصطناعي، وتحسين دقة الترشيحات بين المرشحين والوظائف. تشمل
            هذه البيانات تفاعلاتك مع المنصة، تفضيلاتك، وسجل البحث والتقديم، مما
            يساعدنا على تقديم توصيات أكثر ملاءمة لك مع مرور الوقت. نلتزم بأن يتم
            استخدام هذه البيانات فقط في تحسين جودة الخدمة، وليس لأي أغراض تجارية
            خارج نطاق المنصة.
          </p>
        </div>
        <div class="space-y-2">
          <h2 class="lg:text-xl sm:text-lg text-base font-bold text-[#115E59]">
            5. استخدام الكوكيز (Cookies)
          </h2>
          <p class="lg:text-sm text-xs">
            نقوم بجمع البيانات بهدف تحسين خدماتنا وتقديم تجربة توظيف أكثر دقة
            وفعالية. نستخدم البيانات لفهم سلوك المستخدمين، وتطوير خوارزميات
            الذكاء الاصطناعي، وتحسين دقة الترشيحات بين المرشحين والوظائف. تشمل
            هذه البيانات تفاعلاتك مع المنصة، تفضيلاتك، وسجل البحث والتقديم، مما
            يساعدنا على تقديم توصيات أكثر ملاءمة لك مع مرور الوقت. نلتزم بأن يتم
            استخدام هذه البيانات فقط في تحسين جودة الخدمة، وليس لأي أغراض تجارية
            خارج نطاق المنصة.
          </p>
        </div>
      </div>
    </div>
  </Container>
</template>
